{
  "common": {
    "welcome": "Welcome to Mind Helper",
    "loading": "Loading...",
    "error": "An error occurred",
    "retry": "Retry"
  },
  "auth": {
    "signIn": "Sign In",
    "signOut": "Sign Out",
    "signInWithGoogle": "Sign in with Google",
    "signInWithApple": "Sign in with Apple",
    "guestMode": "Try as Guest"
  },
  "onboarding": {
    "title": "Meet Your Spiritual Life Coach",
    "subtitle": "Please enter your birth date, time, and persona",
    "birthDate": "Birth Date",
    "birthTime": "Birth Time",
    "mbti": "MBTI Type",
    "interests": "Interests",
    "currentConcern": "Current Concern",
    "voiceInput": "Voice Input",
    "voiceListening": "Listening...",
    "voiceHint": "Example: \"3:30 PM\" or \"15:30\".",
    "voiceApplied": "Birth time set to {{time}}.",
    "voiceInvalidTime": "Couldn't recognize the time. Please try again.",
    "voiceNotSupported": "Voice input is not supported in this browser.",
    "submit": "Get Started"
  },
  "dashboard": {
    "title": "Today's Fortune",
    "dailyQuest": "Daily Quest",
    "level": "Level",
    "exp": "EXP",
    "streak": "Streak"
  },
  "coaching": {
    "title": "AI Coaching",
    "career": "Career",
    "love": "Love",
    "today": "Today's Fortune",
    "askQuestion": "Ask Question",
    "voiceChat": "Voice Chat",
    "send": "Send",
    "intro": "Hello. I'll help you with personalized analysis based on Saju, Psychology, Tarot, MBTI, Birkman, and Dark Psychology. I'll ask you for information in 3 steps.",
    "step1Question": "Step 1: Please tell me your date and time of birth. (e.g. 1990-05-15 15:30)",
    "step2Question": "Step 2: Please tell me your MBTI type and interests. (e.g. INFP, music, reading)",
    "step3Question": "Step 3: What would you like to know most right now? Please write one sentence.",
    "thinking": "Analyzing...",
    "resultTitle": "Saju & Analysis Result",
    "analyzingSaju": "🔮 Checking your Four Pillars (year, month, day, hour) now.",
    "analyzingPsych": "💬 Looking at patterns from a psychology perspective.",
    "analyzingTarot": "🃏 Reading the Tarot symbols for you.",
    "analyzingMbti": "🧠 Weaving in MBTI insights for your type.",
    "analyzingBirkman": "📊 Adding Birkman style into the mix.",
    "analyzingDark": "🎭 Sprinkling in a bit of dark psychology.",
    "analyzingAlmost": "✨ Almost there—putting the finishing touches!"
  },
  "result": {
    "title": "What does Mind Helper say?",
    "sajuPillars": "Four Pillars",
    "oheng": "Oheng (Five Elements)",
    "interpretation": "Interpretation",
    "sourcesUsed": "Sources Used",
    "response": "Mind Helper's Advice",
    "responseSubtitle": "A comprehensive analysis based on the six sections above (Saju, Psychology, Tarot, MBTI, Birkman, Dark Psychology).",
    "insightTitle": "Key Insights",
    "insightSubtitle": "Summary of the six perspectives. See each section for Mind Helper's advice per perspective.",
    "briefSummaryLabel": "Brief Summary",
    "briefSummarySubtitle": "See Mind Helper's advice per perspective in the six sections below.",
    "briefSummaryFallback": "Your personalized analysis across six perspectives is ready. Check each section for advice.",
    "finalInsightTitle": "Key Insights",
    "finalInsightSubtitle": "Final synthesis based on each section. Here are the main takeaways.",
    "mindHelperAdvice": "Mind Helper's Advice",
    "reflectedInAdvice": "This perspective is reflected in \"Mind Helper's Advice\" below.",
    "personaIntro": "Hi, I'm your friendly guide to this report. Below you'll find Saju, MBTI, Birkman, Psychology, Dark Psychology, and your path forward—all in plain language. Ask the chatbot at the bottom if you'd like to go deeper.",
    "helpBtn": "Help",
    "detailBtn": "See more",
    "copyBtn": "Copy text",
    "copyDone": "Copied!",
    "chatbotTitle": "Ask more about your result",
    "chatbotPlaceholder": "e.g. Explain the Saju part in more detail",
    "chatbotIntro": "Ask anything about your result for a tailored explanation.",
    "sectionSaju": "Saju (Four Pillars)",
    "sectionMbti": "MBTI",
    "sectionBirkman": "Birkman",
    "sectionPsychology": "Psychology",
    "sectionDark": "Dark Psychology",
    "sectionPath": "Path Forward",
    "sectionSajuDesc": "Your Four Pillars and Oheng from your birth date and time. Your day pillar's element is the base of your temperament.",
    "sectionMbtiDesc": "Traits and insights reflected in this analysis for your type.",
    "sectionBirkmanDesc": "Insights based on behavior style, needs, and stress reactions.",
    "sectionPsychologyDesc": "Patterns and advice from a counseling perspective.",
    "sectionDarkDesc": "References from dark psychology (e.g. dark triad, manipulation, defense).",
    "sectionPathDesc": "Overall suggestions for direction and next steps.",
    "sectionTarot": "Tarot",
    "sectionTarotDesc": "Tarot card symbols and spread were used to add intuitive flow to this analysis.",
    "resultDetailSaju": "The interpretation above is based on your Four Pillars and Oheng distribution. Your day pillar's element is the core of temperament; the balance of the five elements helps you understand how to support your energy.",
    "resultDetailPsychology": "Cognitive, emotional, and behavioral patterns from a counseling perspective are reflected here. Psychological advice tailored to your situation is woven into the overall result.",
    "resultDetailTarot": "Major Arcana and card symbols were used to read flow and intuition for your question. Card energies relevant to your question are reflected in the analysis.",
    "resultDetailMbti": "Insights based on your personality type preferences and strengths. Your type (one of the 16) is reflected in the combined interpretation.",
    "resultDetailBirkman": "Birkman dimensions—behavior style, needs, and stress reactions—were used. How to apply this in daily life and relationships is included in the overall result.",
    "resultDetailDark": "Concepts from dark psychology (power, persuasion, defense) are referenced to help you widen your perspective on relationships and choices.",
    "helpSaju": "Saju (Four Pillars) means the four 'pillars' of your birth: year, month, day, and hour. Each pillar is written with one Heavenly Stem and one Earthly Branch (e.g. 甲子), so there are eight characters in total—hence 'Four Pillars, Eight Characters' (四柱八字).\n\nThe stems and branches cycle in 60 combinations. These are then mapped to the five elements (Oheng: Wood, Fire, Earth, Metal, Water). From the distribution and your day pillar's element, we interpret temperament and balance. The manseryeok (calendar) is the table used to compute this from your birth date and time.",
    "detailSaju": "Here is a deeper look at how the Saju (Four Pillars) part was used in this analysis.\n\n【How to read the result】\nThe year, month, day, and hour pillars on screen are the 'four pillars' of your birth converted using the traditional calendar (manseryeok). The ratio of Wood, Fire, Earth, Metal, and Water (Oheng) is derived from the Heavenly Stems and Earthly Branches of each pillar. The element of your day pillar is interpreted as your core energy and is traditionally the center of temperament and tendency.\n\n【How it was used in this analysis】\nBased on your question and situation, we used your day-pillar element and the five-element balance (which elements are stronger or weaker) to suggest how you might use and support your energy. If one element is dominant or lacking, the idea of gently supplementing through daily life (color, direction, activity, relationships) is reflected in the advice.\n\n【Note】\nSaju is a reference only; life decisions are yours. You can ask the chatbot below if you have questions.",
    "sajuSourceTitle": "Source for Saju calculation (KARI Lunar-Solar Calendar)",
    "helpPsychology": "In counseling, we look at how thoughts (cognition), emotions, and behavior are linked. When you're stressed or worried, noticing 'what thought led to this feeling' and 'what action followed' helps you see repeating patterns.\n\nIn this analysis, we used such cognitive–emotional–behavioral patterns to shape psychological advice that fits your question and situation. This is not a substitute for professional counseling but is designed to support self-understanding and direction.",
    "detailPsychology": "Here is how the counseling perspective was used in this analysis and how to get the most from the result.\n\n【What this perspective offers】\nIn counseling we look at how thoughts (cognition), emotions, and behavior are linked. For example, the thought 'I might fail' can trigger anxiety and then avoidance. Simply acknowledging such patterns without judging them can create space for different choices.\n\n【How it was used】\nUsing your question and concerns, we drew on the cognition–emotion–behavior link to shape psychological advice that fits your situation. This was combined with other domains (Saju, MBTI, Tarot, etc.) to support self-understanding and direction.\n\n【Tips】\nWhen reading the advice, lightly recall 'what thought made me uncomfortable' and 'what I did then'—this can make your patterns clearer. If things feel overwhelming, consider professional counseling as well.",
    "helpTarot": "Tarot is a 78-card system (22 Major Arcana, 56 Minor Arcana) used to read situation, energy, and possibility. The Major Arcana often represents life's larger themes; the Minor Arcana, day-to-day details.\n\nIn this service, we use Major Arcana symbols and meanings alongside your question and other domains (e.g. Saju, psychology) to add an intuitive sense of 'what energy is present' and 'what direction to consider.' Use it as a tool for reflection, not as fortune-telling.",
    "detailTarot": "Here is how Tarot was used in this analysis and how to use the result.\n\n【Tarot's role in the analysis】\nTarot uses 78 cards (22 Major, 56 Minor) to read the energy and flow of the moment. In this service we combined your question with Saju, psychology, MBTI, etc., and used Major Arcana and other symbols to suggest 'what energy is present' and 'what direction to consider.' It is a tool for reflection and self-dialogue, not fortune-telling.\n\n【Cards in this reading】\nIf cards are shown below, their basic meanings and link to your question are reflected in the Tarot section of 'Mind Helper's Advice.' Viewing the card images can help you feel what energy was reflected.\n\n【Tips】\nTreat Tarot as 'one possible perspective,' not 'how it must be.' Day-to-day choices remain yours.",
    "helpMbti": "MBTI (Myers-Briggs Type Indicator) uses four preference dimensions to form 16 personality types.\n\nE (Extraversion) vs I (Introversion): where you get energy—from the outer world or inner world.\nS (Sensing) vs N (Intuition): how you take in information—concrete facts or patterns and possibilities.\nT (Thinking) vs F (Feeling): how you decide—logic and criteria or values and impact on people.\nJ (Judging) vs P (Perceiving): how you organize life—planned and closed or flexible and open.\n\nYour reported type was used to tailor insights and suggestions in the combined result. Types are a framework; individual differences always apply.",
    "detailMbti": "Here is how MBTI was used in this analysis and how to understand the result.\n\n【MBTI's role】\nMBTI combines four preferences—energy direction (E/I), perception (S/N), judgment (T/F), and lifestyle (J/P)—into 16 types. We used your reported type to tailor insights and advice to your question and situation: when you tend to spend energy, and what decision-making and communication styles fit you.\n\n【What you'll see】\nThe MBTI section of 'Mind Helper's Advice' includes strengths, cautions, and energy tips for your type in context. Treat type as a framework and your own experience as primary; use the result as a 'perspective to consider.'\n\n【Tips】\nRecognizing type differences (e.g. introversion vs extraversion) can help with relationship stress. If something doesn't fit the type description, that's normal—individual variation always applies.",
    "helpBirkman": "The Birkman assessment measures behavior style, needs, and stress responses across several dimensions. It helps you understand how you typically act, what you need, and how you react under stress.\n\nIn this analysis, we used Birkman-style dimensions (without a full assessment) to interpret your result together with Saju, MBTI, and psychology. Behavior, needs, and stress reactions are reflected in the combined output.",
    "detailBirkman": "Here is how the Birkman perspective was used and how to apply the result.\n\n【Birkman's role】\nThe Birkman assessment looks at typical behavior style, needs, and stress reactions. In this analysis we used Birkman-style dimensions (without a full assessment) to interpret your result together with Saju, MBTI, and psychology—how you move through daily life and what happens when needs go unmet.\n\n【What you'll see】\nThe Birkman section of 'Mind Helper's Advice' includes direction that considers behavior style, needs, and stress reactions—with hints for relationships, teams, and how to care for yourself when stressed.\n\n【Tips】\nCompare times when your needs were met vs not—your reaction patterns become clearer. Small experiments (e.g. changing how you rest or set boundaries) can help you apply the result in daily life.",
    "helpDark": "Dark psychology studies the 'darker' side of human behavior: manipulation, power, persuasion, and defense mechanisms. Understanding how these work is not to harm others but to make wiser choices in relationships and decisions.\n\nThe dark triad refers to Machiavellianism (manipulation), narcissism (self-centeredness), and psychopathy (lack of empathy). In this analysis, we reference these concepts to support your understanding of relationships and decision-making. Use this from a perspective of protecting yourself and others.",
    "detailDark": "Here is how the dark psychology perspective was used and how to apply it.\n\n【What this perspective offers】\nDark psychology studies how manipulation, power, persuasion, and defense mechanisms work—not to harm others but to help you make wiser choices in relationships and decisions. Concepts such as the dark triad (Machiavellianism, narcissism, lack of empathy) and persuasion/defense were used as a lens for understanding relationships and decisions.\n\n【How it was used】\nThe dark psychology section of 'Mind Helper's Advice' includes self-protection, boundaries, and saying no to burdensome requests, tailored to your question and other domains. Use it to protect yourself and your relationships, not to control or harm others.\n\n【Tips】\nKnowing that 'such mechanisms can exist' can widen your options when you wonder about someone's motives or persuasion style. Respect your own boundaries and consider professional support if needed.",
    "helpPath": "Your path forward is a direction and action plan suggested by combining Saju, psychology, MBTI, Tarot, Birkman, and dark psychology. Priorities and steps are summarized here.",
    "detailPath": "Here is how your 'Path Forward' was built and how to use it.\n\n【What this section is】\nYour Path Forward combines the six perspectives—Saju, psychology, MBTI, Tarot, Birkman, and dark psychology—into direction and action steps that fit your question and situation. We pulled insights from each domain and suggested what you might try over the next 1–2 weeks and over a month.\n\n【How to read it】\nThe order and steps are suggestions. Adjust them to your schedule, energy, and context, or pick one low-pressure step to start. Reading the full 'Mind Helper's Advice' and the AI summary below will show why these priorities and steps were suggested.\n\n【Tips】\nChoose one small action you can do in 1–2 weeks rather than doing everything at once. Review weekly what changed; that will help you design the next step. You can keep asking the chatbot below for more detail.",
    "tarotCardsTitle": "Cards drawn for this reading",
    "viewTarotCards": "View cards from this reading",
    "viewTarotCardImages": "View card images",
    "tarotNoCards": "No cards were drawn for this reading. Start a new coaching session to see tarot cards.",
    "tarotLoading": "Drawing cards…",
    "tarotReversed": "Reversed",
    "redoCoaching": "Start AI coaching again"
  },
  "nav": {
    "home": "Home",
    "coaching": "Coaching",
    "profile": "Profile",
    "settings": "Settings"
  }
}
